package cloud.xcan.sdf.core.utils;

public enum MobileExp {

  CN("中国", "^(\\+?0?86\\-?)?1[3456789]\\d{9}$"),
  HK("香港", "^(\\+?852\\-?)?[569]\\d{3}\\-?\\d{4}$"),
  MO("澳门", "^(\\+?853\\-?)?6\\d{7}"),
  TW("台湾", "^(\\+?886\\-?|0)?9\\d{8}$"),
  US("美国", "^(\\+?1)?[2-9]\\d{2}[2-9](?!11)\\d{6}$"),
  CA("加拿大", "^(\\+?1)?[2-9]\\d{2}[2-9](?!11)\\d{6}$"),
  JP("日本", "^(\\+?81|0)\\d{1,4}[ \\-]?\\d{1,4}[ \\-]?\\d{4}$"),
  KR("韩国", "^(00)?82\\-?0[71](?:\\d{8,9})$"),
  GB("英国", "^(\\+?44|0)7\\d{9}$"),
  AU("澳大利亚", "^(\\+?61|0)4\\d{8}$"),
  DK("丹麦", "^(\\+?61|0)4\\d{8}$"),
  CH("瑞士",
      "^(\\b(0041|0)|\\B\\+41)(\\s?\\(0\\))?(\\s)?[1-9]{2}(\\s)?[0-9]{3}(\\s)?[0-9]{2}(\\s)?[0-9]{2}\\b$"),
  IN("印度", "^(\\+?91|0)?[789]\\d{9}$"),
  RU("俄罗斯", "^(\\+?7|8)?9\\d{9}$"),
  LK("斯里兰卡",
      "^(?:0|94|\\+94)?(?:(11|21|23|24|25|26|27|31|32|33|34|35|36|37|38|41|45|47|51|52|54|55|57|63|65|66|67|81|912)(0|2|3|4|5|7|9)|7(0|1|2|4|5|6|7|8)\\d)\\d{6}$"),
  DE("德国",
      "^(\\+?49[ \\.\\-])?([\\(]{1}[0-9]{1,6}[\\)])?([0-9 \\.\\-\\/]{3,20})((x|ext|extension)[ ]?[0-9]{1,4})?$");

  private String desc;

  private String exp;

  MobileExp(String desc, String exp) {
    this.desc = desc;
    this.exp = exp;
  }

  public String getDesc() {
    return desc;
  }

  public void setDesc(String desc) {
    this.desc = desc;
  }

  public String getCode() {
    return this.name();
  }

  public String getExp() {
    return exp;
  }

  public void setExp(String exp) {
    this.exp = exp;
  }
}